<!DOCTYPE html>
<html lang="pt-br">

<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <style>
        p,
        li,
        button {
            font-size: large;
        }
    </style>
    <title>Trabalho Formulário Web</title>
</head>

<body>
    <div class="container" style="text-align: center; width: 50%;">
        <h1>Trabalho Formulário Web</h1>
        <un>
            <li>Ana Constância</li>
            <li>Alexander Ribeiro</li>
            <li>Diogo Schwartz</li>
            <li>Lucas Rodrigues</li>
        </un>
        <h2>Pesquisa sobre formulários:</h2>
        <ol style="list-style-type: upper-alpha;">
            <li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Na tag &lt;input&gt; com
                    atributo type="text", para que serve o atributo "placeholder"?</span>
                <ul>
                    <li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">O atributo placeholder
                            &eacute; utilizado para podermos inserir uma sugest&atilde;o de valores no campo de
                            inser&ccedil;&atilde;o, podemos ter como exemplo uma sugest&atilde;o de valor para o
                            usu&aacute;rio antes dele inserir propriamente os valores. no caso do texto vai existir uma
                            sugest&atilde;o de texto que servir&aacute; de exemplo para o usu&aacute;rio.</span></li>
                </ul>
            </li>
            <li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Na tag &lt;input&gt; com
                    atributo type="radio" ou type="checkbox", para que serve o atributo "checked"?<br /></span>
                <ul>
                    <li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Serve para definir uma
                            caixa de sele&ccedil;&atilde;o quando marcada dentre as outras op&ccedil;&otilde;es. As
                            caixas de sele&ccedil;&atilde;o s&atilde;o usadas para que o usu&aacute;rio possa selecionar
                            uma ou mais op&ccedil;&otilde;es dentre as caixas que est&atilde;o dispon&iacute;veis para
                            ele.</span></li>
                </ul>
            </li>
            <li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Na tag &lt;input&gt; para que
                    serve o atributo "value"?</span>
                <ul>
                    <li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">A tag atributo valor
                            serve para atribuir um determinado valor &aacute; um elemento, entretanto o atributo valor
                            &eacute; usado de forma diferente para cada tipo de entrada, por isso n&atilde;o podemos
                            usar por exemplo &lt;input type=''file''&gt;</span></li>
                </ul>
            </li>
            <li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Que atributo deve ser utilizado
                    para agrupar v&aacute;rios bot&otilde;es de r&aacute;dio em um formul&aacute;rio de modo que apenas
                    um deles fique marcado de cada vez?<br /></span>
                <ul>
                    <li style="font-weight: 400;" aria-level="1">
                        <p><span style="font-weight: 400;">O atributo r&aacute;dio deve compartilhar o mesmo atributo
                                &ldquo;name&rdquo; para, desta forma, ser tratado como um grupo. Os bot&otilde;es de
                                op&ccedil;&atilde;o s&atilde;o normalmente apresentados em grupos de r&aacute;dio (uma
                                cole&ccedil;&atilde;o de bot&otilde;es de op&ccedil;&atilde;o que descrevem um conjunto
                                de op&ccedil;&otilde;es relacionadas). Apenas um bot&atilde;o de op&ccedil;&atilde;o em
                                um grupo pode ser selecionado ao mesmo tempo.</span></p>
                    </li>
                </ul>
            </li>
            <li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Para que serve a tag
                    &lt;label&gt;? Para que serve o atributo "for" nessa tag?</span>
                <ul>
                    <li style="font-weight: 400;" aria-level="1">
                        <p><span style="font-weight: 400;">A &ldquo;label&rdquo; (r&oacute;tulo) serve para informar
                                para que serve cada campo do formul&aacute;rio HTML, facilitando o entendimento do
                                usu&aacute;rio. Se voc&ecirc; utilizar a tag &lt;label&gt; juntamente com o
                                par&acirc;metro &ldquo;for&rdquo;, poder&aacute; fazer um v&iacute;nculo entre um
                                r&oacute;tulo e um campo do formul&aacute;rio de forma que, ao clicar no r&oacute;tulo,
                                voc&ecirc; ter&aacute; o mesmo resultado como se clicasse no campo vinculado. Para que o
                                par&acirc;metro &ldquo;for&rdquo; da tag &lt;label&gt; funcione corretamente, devemos
                                tamb&eacute;m definir o par&acirc;metro &ldquo;id&rdquo; do controle relacionado.</span>
                        </p>
                    </li>
                </ul>
            </li>
            <li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Na tag &lt;option&gt; para que
                    serve o atributo "selected"?</span>
                <ul>
                    <li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">A &lt;option&gt;tag
                            define uma op&ccedil;&atilde;o em uma lista de sele&ccedil;&atilde;o</span></li>
                    <li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">&lt;option&gt;elementos
                            v&atilde;o dentro de um elemento &lt;select&gt; , &lt;optgroup&gt; ou &lt;datalist&gt;
                            .</span></li>
                    <li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">O atributo
                            &ldquo;selected&rdquo; &eacute; um atributo booleano. Se utilizado, especifica que uma
                            op&ccedil;&atilde;o deve ser pr&eacute;-selecionada quando a p&aacute;gina for carregada. A
                            op&ccedil;&atilde;o pr&eacute;-selecionada ser&aacute; exibida primeiro na lista suspensa.
                            Tamb&eacute;m pode ser definido ap&oacute;s o carregamento da p&aacute;gina, com um
                            JavaScript.</span></li>
                    <li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Nota: A
                            &lt;option&gt;tag pode ser usada sem nenhum atributo, mas normalmente voc&ecirc; precisa do
                            atributo value , que indica o que &eacute; enviado ao servidor no envio do
                            formul&aacute;rio.<br /></span></li>
                </ul>
            </li>
            <li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Nas tags de formul&aacute;rio
                    para que serve o atributo "required"</span>
                <ul>
                    <li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">O atributo
                            &ldquo;required&rdquo; especifica que um campo de entrada deve ser preenchido antes de
                            enviar o formul&aacute;rio. Funciona com os seguintes tipos de entrada: text, search, url,
                            tel, email, password, date pickers, number, checkbox, radio e file.</span></li>
                </ul>
            </li>
            <li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Na tag &lt;form&gt; para que
                    serve o atributo "action"?</span>
                <ul>
                    <li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">O atributo "action"
                            especifica para onde enviar os dados do formul&aacute;rio quando um formul&aacute;rio
                            &eacute; enviado. Normalmente, os dados do formul&aacute;rio s&atilde;o enviados para um
                            arquivo no servidor quando o usu&aacute;rio clica no bot&atilde;o enviar.</span></li>
                </ul>
            </li>
            <li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Na tag &lt;form&gt; para que
                    serve o atributo "method"?</span>
                <ul>
                    <li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">O atributo "method"
                            especifica o m&eacute;todo HTTP a ser usado ao enviar os dados do formul&aacute;rio. Os
                            dados do formul&aacute;rio podem ser enviados como vari&aacute;veis ​​de URL (com
                            method="get") ou como transa&ccedil;&atilde;o de postagem HTTP (com method="post").</span>
                    </li>
                    <li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">O m&eacute;todo HTTP
                            padr&atilde;o ao enviar dados de formul&aacute;rio &eacute; GET, o qual n&atilde;o deve ser
                            usado para dados confidenciais, pois ficam vis&iacute;veis na URL e &eacute; limitado a 2048
                            caracteres. J&aacute; no POST, se os dados do formul&aacute;rio contiverem
                            informa&ccedil;&otilde;es confidenciais ou pessoais, estas n&atilde;o s&atilde;o mostrados
                            na URL. O POST n&atilde;o tem limita&ccedil;&otilde;es de tamanho e pode ser usado para
                            enviar grandes quantidades de dados.<br /></span></li>
                </ul>
            </li>
            <li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Para que o valor digitado de
                    uma senha n&atilde;o apare&ccedil;a na barra de endere&ccedil;os do navegador, qual deve ser o valor
                    do atributo "method" na tag &lt;form&gt;?<br /></span>
                <ul>
                    <li style="font-weight: 400;" aria-level="1">
                        <p><span style="font-weight: 400;">O atributo &ldquo;selected&rdquo; &eacute; um atributo
                                booleano. Se utilizado, especifica que uma op&ccedil;&atilde;o deve ser
                                pr&eacute;-selecionada quando a p&aacute;gina for carregada. A op&ccedil;&atilde;o
                                pr&eacute;-selecionada ser&aacute; exibida primeiro na lista suspensa. Tamb&eacute;m
                                pode ser definido ap&oacute;s o carregamento da p&aacute;gina, com um JavaScript.</span>
                        </p>
                    </li>
                </ul>
            </li>
            <li style="font-weight: 400;" aria-level="1"><span style="font-weight: 400;">Qual valor deve ser informado no atributo "method" na tag
                &lt;form&gt; em um formul&aacute;rio que ser&aacute; usado para fazer upload de arquivos?<br /></span>
            <ul>
                <li style="font-weight: 400;" aria-level="1">
                    <p><span style="font-weight: 400;">No formul&aacute;rio, o valor informado &eacute; o
                        method="post".</span>
                    </p>
                </li>
            </ul>
        </ol>
        <h3>Exercício prático de formulários:</h3>
        <a href="formulario.html"><button>ACESSAR O FORMULÁRIO</button></a>
    </div>
</body>

</html>